seasons_dic = {12: "Зима", 1: 'Зима', 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето",
               9: "Осень", 10: "Осень", 11: "Осень"}
month = int(input("Метод: Словарь. Введите число от 1 до 12, чтобы узнать какое это время года: "))

print(F'{month} - это {seasons_dic[month]}')

month_list = int(input("Метод: Список. Введите число от 1 до 12, чтобы узнать какое это время года: "))
seasons_list = ["зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
print(F'{month_list} - это {seasons_list[month_list - 1]}')
